cf/Documents/ОплатаЭлектроннымиДеньгами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОплатаЭлектроннымиДеньгами</Name>
			<BasedOn>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>BusinessProcess.ИнтернетЗаявка</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйКошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныйКошелек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорПлатежнойСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЧекККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ФормаОтношений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормаОтношений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВидыОперацииДенежныеСредстваВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацииДенежныеСредстваВПути</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДСОтОператора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВидыОперацийВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/ОплатаЭлектроннымиДеньгами/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	|ВЫБРАТЬ
	|	ИнтернетЗаказПокупателя, ЭлектронныйКошелек, Контрагент
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|" + 
	РаботаСКурсамиВалют.ПолучитьТекстЗапросаКурсыВалют() + "
	|;
	
	// ВЗАИМОРАСЧЕТЫ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР 
	|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|		ТОГДА &ВидДвиженияПриход
	|		ИНАЧЕ &ВидДвиженияРасход
	|	КОНЕЦ 											ВидДвижения,
	|	&Организация							 		Организация, 
	|	Док.Партнер					 					Партнер,
	|	Док.Контрагент 									Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Клиент) 	ФормаОтношений,	
	|	Док.Сумма					 					Сумма, " + 
		РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма") + " СуммаУпр
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют ПО ИСТИНА
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	
	//// ОПЛАТЫ
	//
	//|ВЫБРАТЬ
	//|	&Период					Период,
	//|	Ссылка 					ДокументОплаты,
	//|	ВЫБОР КОГДА Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	//|		ТОГДА -0   //при возврате комиссия не возвращается
	//|		ИНАЧЕ  СуммаКомиссии
	//|		КОНЕЦ  СуммаКомиссии,
	//|	ИнтернетЗаказПокупателя	Заказ,
	//|	Партнер,
	//|	Организация,
	//|	ВЫБОР КОГДА Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	//|		ТОГДА -Сумма
	//|		ИНАЧЕ  Сумма
	//|		КОНЕЦ  Сумма
	//|ИЗ
	//|	Документ.ОплатаЭлектроннымиДеньгами
	//|ГДЕ
	//|	Ссылка = &Ссылка И ИнтернетЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ИнтернетЗаказПокупателя.ПустаяСсылка)
	//|;
	//
	//// АВАНСЫ
	//
	//|ВЫБРАТЬ
	//|	&Период				Период,
	//|	&ВидДвиженияПриход 	ВидДвижения,
	//|	Док.Партнер				Партнер,
	//|	Док.Ссылка 				ДокументОплаты,
	//|	ВЫБОР КОГДА Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	//|		ТОГДА -Сумма
	//|		ИНАЧЕ  Сумма
	//|		КОНЕЦ  Сумма
	//|ИЗ
	//|	Документ.ОплатаЭлектроннымиДеньгами Док
	//|ГДЕ
	//|	Ссылка = &Ссылка И ИнтернетЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ИнтернетЗаказПокупателя.ПустаяСсылка)
	//|;
	
	// Денежные средства в пути
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияПриход 	ВидДвижения,
	|	Док.ОператорПлатежнойСистемы	Контрагент,
	|	Значение(Перечисление.ВидыОперацииДенежныеСредстваВПути.ОплатаПокупателем)	ВидОперации,
	|	ВЫБОР КОГДА Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|		ТОГДА -Сумма
	|		ИНАЧЕ  Сумма
	|		КОНЕЦ  Сумма
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами Док
	|ГДЕ
	|	Ссылка = &Ссылка 
	|
	|Объединить Все
	|
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход 	ВидДвижения,
	|	Док.ОператорПлатежнойСистемы	Контрагент,
	|	Значение(Перечисление.ВидыОперацииДенежныеСредстваВПути.УдержаниеКомиссии)	ВидОперации,
	|	ВЫБОР КОГДА Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|		ТОГДА 0 //комиссия не возвращается при возврате
	|		ИНАЧЕ  СуммаКомиссии
	|		КОНЕЦ  Сумма
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами Док
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ДОЛГИ КОНТРАГЕНТОВ
	
	//|ВЫБРАТЬ 
	//|	&ВидОперацииОплата ВидОперации, &ФормаОтношений ФормаОтношений, Док.Организация, Док.Контрагент, Ссылка Документ, Док.Дата Дата, Док.Дата Период,
	//|	ЕСТЬNULL(СуммаУпрОстаток, 0) - " + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма") + " Сумма
	////|	ЕСТЬNULL(СуммаУпрОстаток, 0) СуммаВзаиморасчеты
	//|ИЗ
	//|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, Организация = &Организация И Контрагент = &Контрагент)
	//|
	//|ПРАВОЕ СОЕДИНЕНИЕ
	//|	(ВЫБРАТЬ Дата, &Организация Организация, Контрагент, Ссылка, Сумма ИЗ Документ.ОплатаЭлектроннымиДеньгами ГДЕ Ссылка = &Ссылка) Док
	//|ПО ИСТИНА
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют ПО ИСТИНА
	//|;

	// ДОЛГИ ПО ОТГРУЗКАМ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	 	ВидДвижения,
	|	Партнер			Партнер,
	|	Контрагент		Контрагент,
	|	Организация		Организация,
	|	Выбор когда ИнтернетЗаказПокупателя=Значение(Документ.интернетЗаказПокупателя.ПустаяСсылка) Тогда Неопределено Иначе ИнтернетЗаказПокупателя Конец					Заказ,
	|	Выбор когда ДокументОтгрузки=Значение(Документ.РеализацияТоваров.ПустаяСсылка) Тогда Неопределено Иначе ДокументОтгрузки Конец					ДокументОтгрузки,
	|	Выбор когда Ссылка.ВидОперации=&Продажа Тогда Сумма Иначе -Сумма Конец	Сумма
	|
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами 
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|;
	
	// Долги по заказам
	
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияРасход 			ВидДвижения,
	|	Организация					Организация,
	|	Партнер						Партнер,
	|	&Менеджер				 	Менеджер,
	|	Контрагент					Контрагент,      
	|	Выбор когда ИнтернетЗаказПокупателя=Значение(Документ.интернетЗаказПокупателя.ПустаяСсылка) Тогда Неопределено Иначе ИнтернетЗаказПокупателя Конец					Заказ,
	|	Выбор когда Ссылка.ВидОперации=&Продажа Тогда Сумма Иначе -Сумма Конец	Сумма
	|ИЗ
	|	Документ.ОплатаЭлектроннымиДеньгами
	|ГДЕ
	|	Ссылка = &Ссылка
	|");
	
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("Валюта", 			Ссылка.Валюта);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Возврат", 			Перечисления.ВидыОперацийЧекККМ.Возврат);
	Запрос.УстановитьПараметр("Продажа", 			Перечисления.ВидыОперацийЧекККМ.Продажа);
	Запрос.УстановитьПараметр("Менеджер", 			Справочники.Контрагенты.ПолучитьОсновногоМенеджераПартнера(Ссылка.Дата, Ссылка.Контрагент));
	
	Запрос.УстановитьПараметр("Организация", 		Ссылка.Организация);
	Запрос.УстановитьПараметр("Контрагент", 		Ссылка.Контрагент);
	Запрос.УстановитьПараметр("ВидОперацииОплата", 	Перечисления.ВидыОперацийВзаиморасчетов.Оплата);
	Запрос.УстановитьПараметр("ФормаОтношений", 	Перечисления.ФормаОтношений.Клиент);
	
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("Взаиморасчеты", 	Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("Оплаты", Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("Авансы", Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ДенежныеСредстваВПути", Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДолгиКонтрагентов", Пакет[7].Выгрузить());
	ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ДолгиПоЗаказам", Пакет[6].Выгрузить());
	
КонецПроцедуры
